artillery/httpbin_test.yml
# Pierwsze Testy I

config:
  environments:
    stress:
      target: "http://httpbin.org/"
      phases:
        - duration: 6
          arrivalCount: 2
          name: Artillery First Test
        - duration: 5
          arrivalRate: 30
          name: Artillery First Test
        - duration: 5
          arrivalRate: 2
          name: Artillery First Test
      payload:
        -
          path: "keywords.csv"
          fields:
            - "fruit"
            - "car"
          order: sequence
          skipHeader: false
          cast: false
          skipEmptyLines: true
      plugins:
        ensure: {}
      ensure:
        thresholds:
          - http.response_time.p95: 10
          - http.response_time.max: 2000
        conditions:
          - expression: vusers.failed == 0
          - expression: "http.request_rate >= 2 and http.response_time.max < 600"

scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      # - log: "Json value from response is: {{request_body}}"
      # - log: "Host value from response is: {{host}}"